{
    "Header": {
        "file": "Variable-Registry_horizontal-label.json",
        "file_creation_date": "2025-09-15T12:07:47.616968",
        "version": "fatal: No names found, cannot describe anything.",
        "checksum": "md5: 46189236073a3bad7497fa43617da154",
        "repo_url": "https://github.com/WCRP-CMIP/Variable-Registry",
        "repo_prefix": "vr",
        "last_commit": "9c6134d4da628dcb6aa6c69d8c7504594e28133a",
        "comment": "This is an automatically generated file. Do not edit."
    },
    "horizontal-label": {
        "hm": {
            "description": "Variables calculated as spatial averages across horizontal dimensions, typically representing area-weighted means over geographic regions. Used for regional or global horizontal averaging operations.",
            "ui-label": "Horizontal Mean",
            "validation-key": "hm"
        },
        "hs": {
            "description": "Variables represented as point measurements at specific geographic sites or stations. For example, used for observational data, tower measurements, or model output extracted at particular locations rather than gridded data.",
            "ui-label": "Site values",
            "validation-key": "hs"
        },
        "ht": {
            "description": "Variables calculated as means across specific labeled geographic areas or means along defined transects or lines. Used for regional averaging within designated boundaries or linear sampling.",
            "ui-label": "Mean Along Line",
            "validation-key": "ht"
        },
        "hxy": {
            "description": "Variables represented on a regular 2D horizontal grid with longitude and latitude coordinates. Standard format for most climate model output with spatially distributed data across geographic grid points.",
            "ui-label": "Gridded Horizontal",
            "validation-key": "hxy"
        },
        "hxys": {
            "description": "Variables represented as point measurements at specific geographic sites or stations. Used for observational data, tower measurements, or model output extracted at particular locations rather than gridded data.",
            "ui-label": "Site Values",
            "validation-key": "hxys"
        },
        "hy": {
            "description": "Variables calculated as zonal means, averaged along lines of constant latitude (east-west direction). Removes longitudinal variability to show meridional (north-south) patterns and large-scale circulation features.",
            "ui-label": "Zonal Mean",
            "validation-key": "hy"
        },
        "hybs": {
            "description": "Variables calculated as zonal means within specific ocean basins or geographic regions. Provides basin-specific east-west averaging while preserving regional characteristics and circulation patterns within each basin.",
            "ui-label": "Zonal Mean Within Basin",
            "validation-key": "hybs"
        }
    }
}