{
    "Header": {
        "file": "Variable-Registry_temporal-label.json",
        "file_creation_date": "2025-09-15T12:22:57.671158",
        "version": "fatal: No names found, cannot describe anything.",
        "checksum": "md5: 02c94f6b15f7cac9e95b1a7db9b9d61c",
        "repo_url": "https://github.com/WCRP-CMIP/Variable-Registry",
        "repo_prefix": "vr",
        "last_commit": "255c7536ecfa68df688d0e68f2d17f946b1d309f",
        "comment": "This is an automatically generated file. Do not edit."
    },
    "temporal-label": {
        "tavg": {
            "description": "Time-averaged values calculated as the arithmetic mean over a specified time period. Commonly used for monthly, seasonal, or annual averages to represent typical conditions.",
            "ui-label": "Mean Statistic",
            "validation-key": "tavg"
        },
        "tclm": {
            "description": "Variables representing long-term annual cycle climatology, calculated as multi-year averages for each month or season. Shows typical seasonal patterns and annual variations in climate variables over extended time periods.",
            "ui-label": "Annual Climatology",
            "validation-key": "tclm"
        },
        "tclmdc": {
            "description": "Variables representing long-term diurnal cycle climatology, calculated as multi-year averages for each hour or time of day. Shows typical daily patterns and diurnal variations in climate variables over extended time periods.",
            "ui-label": "Diurnal Climatology",
            "validation-key": "tclmdc"
        },
        "ti": {
            "description": "Time-independent values that do not vary with time, such as fixed geographic coordinates, topography, land-sea masks, or other static boundary conditions and model parameters.",
            "ui-label": "Time Independent",
            "validation-key": "ti"
        },
        "tmaxstat": {
            "description": "Variables representing maximum values or mean of daily maximum values over a time period. Used for extreme statistics, temperature maxima, or other variables where peak conditions are of interest.",
            "ui-label": "Maximum Statistic",
            "validation-key": "tmaxstat"
        },
        "tmin": {
            "description": "Variables representing minimum values or mean of daily minimum values over a time period. Used for extreme statistics, temperature minima, or other variables where lowest conditions are of interest.",
            "ui-label": "Minimum Statistic",
            "validation-key": "tmin"
        },
        "tpt": {
            "description": "Instantaneous values sampled at specific points in time, without temporal averaging. Represents snapshots of conditions at discrete time instances, often used for model output at specific time steps.",
            "ui-label": "Point in Time",
            "validation-key": "tpt"
        },
        "tsum": {
            "description": "Time-summed values representing the accumulation or total amount over a specified time period. Commonly used for precipitation totals, energy fluxes, or other cumulative quantities.",
            "ui-label": "Sum Statistic",
            "validation-key": "tsum"
        }
    }
}